Repository: SweetBlue16/UnoLisClient
Catalog: UnoLisClient.UI/Properties/Langs/ErrorMessages.*.resx
Languages: es

# AccountNotVerifiedMessageLabel
source: The account with the email {0} is not verified.
es: La cuenta con el email {0} no está verificada.

# AlreadyFriendsMessageLabel
source: {0} is already on your friends list.
es: {0} ya está en tu lista de amigos.

# BadRequestMessageLabel
source: Incomplete or incorrectly formatted request. Please verify the information or contact support.
es: Petición malformada o con datos incompletos, por favor verifique la información o contacte a soporte.

# BlockedUserMessageLabel
source: You can't send messages to a blocked user.
es: No puedes enviar mensajes a un usuario bloqueado.

# CallbackErrorMessageLabel
source: Error executing client callback.
es: Error al ejecutar el callback del cliente.

# CannotAddSelfMessageLabel
source: You can't add yourself as a friend.
es: No te puedes añadir a ti mismo como amigo.

# ChatInternalErrorMessageLabel
source: Internal error in the chat module.
es: Error interno del módulo de chat.

# ClientDisconnectedMessageLabel
source: The client was disconnected from the remote service.
es: El cliente fue desconectado del servicio remoto.

# ConcurrencyConflictMessageLabel
source: Data conflict or concurrency.
es: Conflicto de datos o concurrencia.

# ConfirmationInternalErrorMessageLabel
source: Internal error in the verification code module.
es: Error interno en el módulo de códigos de verificación.

# ConnectionErrorHeaderLabel
source: Connection Error
es: Error de conexión

# ConnectionErrorMessageLabel
source: Unable to connect with the server. Check your internet connection and try again.
es: No es posible conectar con el servidor. Checa tu conexión a internet e intenta nuevamente.

# ConnectionRejectedMessageLabel
source: The server refused the connection.
es: El servidor rechazó la conexión.

# DatabaseErrorMessageLabel
source: Database error.
es: Error en la base de datos.

# DeckIsEmptyMessageLabel
source: Your deck of cards is empty.
es: Tu mazo de cartas está vacío.

# DuplicateSessionMessageLabel
source: The user is not logged in.
es: El usuario no está conectado.

# EmailAlreadyRegisteredMessageLabel
source: The email address provided is already in use. Please provide another one.
es: El correo electrónico proporcionado ya está en uso, por favor proporciona otro.

# EmailEmptyMessageLabel
source: Email is required.
es: El correo electrónico es requerido.

# EmailFormatMessageLabel
source: The email format is invalid.
es: El formato del email no es válido.

# EmailSendingFailedMessageLabel
source: Error sending email, please try again or contact an administrator.
es: Error al enviar el email, por favor intente de nuevo o contacte a un administrador.

# EmptyFieldsMessageLabel
source: One or more required fields are empty.
es: Uno o más campos requeridos están vacíos.

# FileSystemErrorMessageLabel
source: Error loading file, please contact an administrator.
es: Error al cargar un archivo, por favor contacte a un administrador.

# ForgotToCallUnoMessageLabel
source: {0} forgot to say “UNO.” Draw {1}!
es: {0} se olvidó de decir "UNO". ¡Roba {1}!

# FriendActionCompletedMessageLabel
source: Friend action completed.
es: Acción de amigo completada.

# FriendRequestNotFoundMessageLabel
source: No friend request found for {0}.
es: No se encontró la solicitud de amistad para {0}.

# FriendsInternalErrorMessageLabel
source: Internal error in the friends module.
es: Error interno del módulo de amigos.

# FullNameEmptyMessageLabel
source: Full name is required.
es: El nombre completo es requerido.

# FullNameLengthMessageLabel
source: Full name can't exceed {0} characters.
es: El nombre completo no puede exceder los {0} caracteres.

# GeneralServerErrorMessageLabel
source: General server error.
es: Error general del servidor.

# InappropriatedContentMessageLabel
source: The message contains inappropriate language.
es: El mensaje contiene lenguaje inapropiado.

# InvalidAvatarSelectionMessageLabel
source: You cannot select that avatar. Try another one.
es: No puedes seleccionar ese avatar. Intenta con otro.

# InvalidCredentialsMessageLabel
source: Incorrect username or password, please verify the fields.
es: Usuario o contraseña incorrectos, por favor verifique los campos.

# InvalidDataMessageLabel
source: One or more fields contain invalid data. Please verify the information provided.
es: Uno o más campos contienen datos inválidos, por favor verifique la información proporcionada.

# InvalidSearchQueryMessageLabel
source: {0} was not found in your friends list.
es: No se encontró a {0} en tu lista de amigos.

# InvalidTokenMessageLabel
source: Invalid authentication token.
es: Token de autenticación inválido.

# ItemNotInShopMessageLabel
source: This item is not in the store...
es: Este ítem no está en la tienda...

# LobbyClosedMessageLabel
source: The match was closed by the host.
es: La partida fue cerrada por el anfitrión.

# LobbyFullMessageLabel
source: The lobby already has the maximum number of players allowed (4).
es: El lobby ya tiene el máximo número de jugadores permitidos (4).

# LobbyInconsistentStateMessageLabel
source: Inconsistent lobby state detected.
es: Estado inconsistente del lobby detectado.

# LobbyInternalErrorMessageLabel
source: Internal error in the game/lobby module.
es: Error interno del módulo de partidas/lobby.

# LobbyNotFoundMessageLabel
source: The requested lobby couldn't be found.
es: No se pudo encontrar el lobby solicitado.

# LoginInternalErrorMessageLabel
source: Internal error during login.
es: Error interno durante el inicio de sesión.

# LogoutInternalErrorMessageLabel
source: Internal error during logout.
es: Error interno durante el cierre de sesión.

# MatchAlreadyEndedMessageLabel
source: The game is over now.
es: La partida ya ha finalizado.

# MatchAlreadyStartedMessageLabel
source: You can't join, the game has already started.
es: No puedes unirte, la partida ya inició.

# MatchCancelledMessageLabel
source: The match {0} has been canceled.
es: La partida {0} fue cancelada.

# MatchNotFoundMessageLabel
source: The match with code {0} was not found.
es: No se encontró la partida con el código {0}.

# MessageCantBeEmptyMessageLabel
source: You can't send an empty message.
es: No se puede enviar un mensaje vacío.

# MessageLengthMessageLabel
source: The message exceeds the allowed character limit (200).
es: El mensaje excede el límite de caracteres permitido (200).

# MissingTokenMessageLabel
source: A session token was not provided.
es: No se proporcionó un token de sesión.

# MustDrawCardsMessageLabel
source: First, you must draw cards.
es: Primero debes robar cartas.

# MustPlayOrDrawMessageLabel
source: First, you must play a card or draw one.
es: Primero debes jugar alguna carta o robar una.

# NewPasswordEmptyMessageLabel
source: New password can't be empty.
es: La nueva contraseña no puede estar vacía.

# NicknameAlreadyTakenMessageLabel
source: An account with the associated nickname already exists.
es: Ya existe una cuenta con el nickname asociado.

# NicknameEmptyMessageLabel
source: Nickname is required.
es: El nombre de jugador es requerido.

# NicknameFormatMessageLabel
source: The nickname must contain letters, numbers, hyphens and underscores.
es: El nombre de jugador debe contener tener letras, números, guiones medios y bajos.

# NicknameLengthMessageLabel
source: The nickname length must be between {0} and {1} characters.
es: La longitud del nombre de jugador debe ser entre {0} y {1} caracteres.

# NoConnectionMessageLabel
source: The game is currently unavailable, please try again later.
es: El juego no está disponible por el momento, por favor intenta más tarde.

# NoPermissionsMessageLabel
source: You don't have permission to execute this action.
es: No tienes permisos para realizar esta acción.

# NotEnoughCurrencyMessageLabel
source: You don't have enough Revo coins, please get more.
es: No tienes suficientes monedas Revo, por favor consigue más.

# NotPlayerTurnMessageLabel
source: It's not your turn to play a card.
es: No es tu turno de tirar carta.

# OperationNotSupportedMessageLabel
source: Operation not supported.
es: Operación no soportada.

# PasswordDontMatchMessageLabel
source: Passwords don't match, please verify them.
es: Las contraseñas no coinciden, por favor verifícalo.

# PasswordEmptyMessageLabel
source: Password is required.
es: La contraseña es requerida.

# PasswordLengthMessageLabel
source: The password length must be between {0} and {1} characters.
es: La longitud de la contraseña debe ser entre {0} y {1} caracteres.

# PasswordSameAsOldMessageLabel
source: The new password is the same as the old one.
es: La nueva contraseña es la misma que la anterior.

# PendingFriendRequestMessageLabel
source: There is already a friend request for {0}.
es: Ya existe una solicitud de amistad para {0}.

# PlayerAlreadyReadyMessageLabel
source: The player was already ready.
es: El jugador ya estaba listo.

# PlayerDisconnectedMessageLabel
source: {0} disconnected during the match.
es: {0} desconectado durante la partida.

# PlayerHasActiveLobbyMessageLabel
source: The player already has an active lobby.
es: El jugador ya tiene un lobby activo.

# PlayerLimitReachedMessageLabel
source: No more than 4 players can be added to the match.
es: No se pueden añadir más de 4 jugadores a la partida.

# PlayerNotFoundMessageLabel
source: The specified player was not found.
es: No se encontró al jugador especificado.

# PlayerNotInLobbyMessageLabel
source: The player doesn't belong to the lobby.
es: El jugador no pertenece al lobby.

# PlayerReportFailedMessageLabel
source: Error processing the player report. Please try again or contact an administrator.
es: Error al procesar el reporte al jugador, por favor intenta nuevamente o contacta a un administrador.

# PlayerWereNotReadyMessageLabel
source: The player was not ready.
es: El jugador no estaba listo.

# ProfileFetchFailedMessageLabel
source: Internal error while retrieving profile.
es: Error interno al obtener el perfil.

# ProfileNotLoadedMessageLabel
source: The profile information has not been loaded.
es: La información del perfil no se ha cargado.

# ProfileUpdateFailedMessageLabel
source: Internal error while updating profile.
es: Error interno al actualizar el perfil.

# PurchaseProcessingErrorMessageLabel
source: An error occurred while processing your purchase.
es: Ocurrió un error al procesar la compra.

# RateLimitExceededMessageLabel
source: Many requests in a short time, please hold on...
es: Muchas solicitudes en poco tiempo, espera un poco...

# RegistrationDataLostMessageLabel
source: The registration information was lost because too much time has passed. Please try again.
es: Se perdió la información de registro porque pasó mucho tiempo. Intente nuevamente.

# RegistrationInternalErrorMessageLabel
source: Internal error in the registration module.
es: Error interno en el módulo de registro.

# RewardProcessingErrorMessageLabel
source: An error occurred while processing the reward.
es: Ocurrió un error al procesar la recompensa.

# SerializationErrorMessageLabel
source: Error serializing or deserializing objects.
es: Error al serializar o deserializar objetos.

# ServiceInitializationFailedMessageLabel
source: Error initializing the server, please contact an administrator.
es: Error al inicializar el servidor, por favor contacte a un administrador.

# SessionExpiredMessageLabel
source: The session has expired, please log in again.
es: La sesión ha caducado, inicie sesión de nuevo.

# ShopInternalErrorMessageLabel
source: Internal error in the shop module.
es: Error interno en el módulo de la tienda.

# SocialLinkDomainMessageLabel
source: The URL must belong to the {0} domain.
es: La URL debe pertenecer al dominio de {0}.

# SocialLinkFormatMessageLabel
source: The {0} link is not a valid URL.
es: El link de {0} no es una URL válida.

# SocialNetworkNotConfiguredMessageLabel
source: The user hasn't configured this social network. Please try another one.
es: El usuario no ha configurado esta red social, intente con otra.

# SqlErrorMessageLabel
source: Error when executing an SQL query.
es: Fallo al ejecutar una consulta SQL.

# TimeoutMessageLabel
source: Timeout exceeded.
es: Tiempo de espera agotado.

# TransactionFailedMessageLabel
source: Failed or unconfirmed transaction.
es: Transacción fallida o no confirmada.

# UnableToOpenLinkMessageLabel
source: The link couldn't be opened. Please try again.
es: No se pudo abrir el enlace, intente nuevamente.

# UnauthorizedAccessMessageLabel
source: Unauthorized access.
es: Acceso no autorizado.

# UnhandledExceptionMessageLabel
source: Unhandled exception.
es: Excepción no controlada.

# UnknownErrorMessageLabel
source: Unknown error, please contact the support team.
es: Error desconocido, por favor contacte al equipo de soporte.

# UnstableConnectionMessageLabel
source: Unstable connection detected.
es: Conexión inestable detectada.

# UserNotConnectedMessageLabel
source: The user is not logged in.
es: El usuario no está conectado.

# ValidationFailedMessageLabel
source: Data validation failed.
es: Validación de datos fallida.

# VerificationCodeInvalidMessageLabel
source: The verification code is not valid.
es: El código de verificación no es válido.

# WeakPasswordMessageLabel
source: The password doesn't match the minimum security requirements. Please fix it before continuing.
es: La contraseña no cumple con los requisitos mínimos de seguridad, por favor corrige antes de continuar.
