Repository: SweetBlue16/UnoLisClient
Catalog: UnoLisClient.UI/Properties/Langs/Match.*.resx
Languages: es

# CardDrawnMessageLabel
source: {0} has drawn {1}.
es: {0} ha robado {1}.

# ChooseColorLabel
source: Choose a Color
es: Elige un Color

# DescriptionReportLabel
source: Write the reason for the report:
es: Escribe el motivo del reporte:

# DrawCardTooltip
source: Draw a card
es: Roba una carta

# ExitMatchConfirmationLabel
source: Are you sure you want to leave the match?
es: ¿Estás seguro de que deseas abandonar la partida?

# InvalidMoveMessageLabel
source: The move you made is invalid.
es: El movimiento realizado no es válido.

# ItemUsedLabel
source: Item used!
es: ¡Ítem usado!

# ItemUsedMessageLabel
source: {0} used {1}.
es: {0} usó {1}.

# MatchOverLabel
source: The game is over.
es: La partida ha finalizado.

# MatchResultsLabel
source: Match Results
es: Resultados de partida

# MatchResultsRecordedMessageLabel
source: The result of the match was recorded correctly.
es: El resultado de la partida se registró correctamente.

# MatchStartedLabel
source: Starting game...
es: Iniciando partida...

# OptionsLabel
source: Options
es: Opciones

# PlaceResultsColumn
source: Place
es: Lugar

# PlayerBannedMessageLabel
source: You've been banned, time remaining: {0}
es: Has sido vetado por exceso de reportes, tiempo restante: {0}

# PlayerBlockedMessageLabel
source: {0} has been successfully blocked.
es: {0} ha sido bloqueado con éxito.

# PlayerDeclaredUnoMessageLabel
source: {0} said UNO!
es: ¡{0} dijo UNO!

# PlayerKickedMessageLabel
source: {0} was kicked out of the game.
es: {0} fue expulsado de la partida.

# PlayerNameColumn
source: Player
es: Jugador

# PlayerReportedMessageLabel
source: {0} has been successfully reported.
es: {0} ha sido reportado exitosamente.

# RankColumn
source: Rank
es: Rango

# ReportPlayerLabel
source: Report player
es: Reportar jugador

# ScoreColumn
source: Score
es: Marcador

# SelectReportPlayer
source: Which player do you want to report?
es: ¿Cuál jugador quieres reportar?

# TurnLabel
source: Now playing:
es: Turno de:

# WinnerLabel
source: The player {0} has won!
es: ¡El jugador {0} ha ganado!
